{
  "backend/main.mo": "Defines core backend types and state for delivery orders, riders, users, photos, and access control, using Maps for storage and providing various order-related structures.",
  "feature_evidence.json": "Lists feature evidence records mapping design and UI update requirements to specific frontend files and components with associated metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing their roles in routing, hooks, UI components, and utility functions.",
  "frontend/index.css": "Defines global Tailwind CSS layers and theme variables for light and dark modes, setting color tokens and base styling.",
  "frontend/index.html": "HTML entry point configuring meta tags, manifest, icons, and loading the main React script.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, start URL, orientation, and icon files.",
  "frontend/public/sw.js": "Simple service worker handling install, fetch caching, and activation with versioned static asset caching.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication redirects, service worker registration, and theme provider around the main app.",
  "frontend/src/areas/admin/AdminShell.tsx": "Wraps the admin interface, handling authentication, logout, and tab-based navigation between admin sections.",
  "frontend/src/areas/admin/auth/AdminLoginPage.tsx": "Provides the admin login form with username/password validation and triggers session creation on success.",
  "frontend/src/areas/admin/auth/useAdminAuth.ts": "Implements simple localStorage-based admin authentication with login, logout, and session validation.",
  "frontend/src/areas/admin/pages/AdminCreateOrderPage.tsx": "Form page for creating a new order, validating inputs and submitting via the admin order creation hook.",
  "frontend/src/areas/admin/pages/AdminDashboardPage.tsx": "Displays admin KPIs such as order counts, earnings, and active riders using fetched order and rider data.",
  "frontend/src/areas/admin/pages/AdminOrderDetailPage.tsx": "Shows detailed order information with options to assign riders, update status, and view parcel/proof photos.",
  "frontend/src/areas/admin/pages/AdminOrdersPage.tsx": "Displays and filters admin orders, with navigation to order detail or creation pages.",
  "frontend/src/areas/admin/pages/AdminReportsPage.tsx": "Generates order reports by period and supports CSV export and printing.",
  "frontend/src/areas/admin/pages/AdminRidersPage.tsx": "Manages rider list with add, edit location, and delete actions.",
  "frontend/src/areas/admin/pages/AdminSettingsPage.tsx": "Handles company settings, logo upload, and delivery rate management.",
  "frontend/src/areas/customer/components/CustomerBottomNav.tsx": "Renders bottom tabs for customer navigation using a mobile-friendly component.",
  "frontend/src/areas/customer/CustomerShell.tsx": "Hosts customer pages and bottom navigation for booking, orders, and profile.",
  "frontend/src/areas/customer/pages/CustomerBookDeliveryPage.tsx": "Allows customers to submit new delivery orders with optional parcel photos.",
  "frontend/src/areas/customer/pages/CustomerOrderDetailPage.tsx": "Displays detailed info for a customer’s order, including status, addresses, and any parcel or proof photos, with a back button.",
  "frontend/src/areas/customer/pages/CustomerOrdersPage.tsx": "Shows the customer’s list of orders with status badges and opens the detail page when an order is selected.",
  "frontend/src/areas/customer/pages/CustomerProfilePage.tsx": "Shows customer profile info, app install option, and supports logging out and clearing identity data.",
  "frontend/src/areas/rider/components/RiderBottomNav.tsx": "Defines the rider bottom navigation tabs and passes them to the shared mobile nav component.",
  "frontend/src/areas/rider/pages/RiderOrderDetailPage.tsx": "Displays rider-specific order details with navigation, pickup/delivery actions, and proof photo upload.",
  "frontend/src/areas/rider/pages/RiderOrdersPage.tsx": "Shows the rider’s assigned orders list with status and opens the detail view when selected.",
  "frontend/src/areas/rider/pages/RiderProfilePage.tsx": "Shows rider profile info, app install option, and supports logout and clearing user data.",
  "frontend/src/areas/rider/RiderShell.tsx": "Provides the main rider layout switching between orders and profile tabs with a bottom nav bar.",
  "frontend/src/components/actions/WhatsAppMessageDialog.tsx": "Modal dialog showing a WhatsApp message with a copy-to-clipboard action and success/error feedback.",
  "frontend/src/components/actions/WhatsAppOrderAction.tsx": "Triggers WhatsApp contact link for an order and provides a fallback dialog to view and copy the message.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied card with options to go back or sign out by clearing user data and identity.",
  "frontend/src/components/layout/AppSurface.tsx": "Wrapper component providing a full-height app surface container with optional custom classes.",
  "frontend/src/components/layout/MobileBottomNav.tsx": "Renders a fixed bottom navigation bar on mobile with icon tabs and active state handling.",
  "frontend/src/components/layout/PageContainer.tsx": "Centered page container with optional bottom-nav spacing and customizable styling.",
  "frontend/src/components/patterns/EmptyStateCard.tsx": "Card component for empty states with an icon, title, and optional description.",
  "frontend/src/components/photos/PhotoCapturePicker.tsx": "Provides camera-based or file-based photo selection with a full-screen camera dialog and capture flow.",
  "frontend/src/components/pwa/FloatingInstallFab.tsx": "Floating action button prompting PWA installation with loading state handling.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Full-width button to trigger PWA install flow with install/loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdminOrders.ts": "React-query hooks for fetching, creating, assigning, and updating orders through the backend actor.",
  "frontend/src/hooks/useAdminRiders.ts": "React-query hooks for managing riders including fetching, adding, updating location, and client-side deletion.",
  "frontend/src/hooks/useAdminSettings.ts": "Provides hooks to load, update, and persist admin settings, logo, and delivery rates using localStorage.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches current user profile and admin status from the actor and provides a helper to clear cached user data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useOrders.ts": "Exposes hooks to create orders and fetch user or single order data, with query invalidation on mutations.",
  "frontend/src/hooks/usePhotoUploads.ts": "Adds hooks for uploading parcel and proof photos and invalidates related order queries on success.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Handles PWA install prompt detection on Android, tracks installability, and exposes an install action.",
  "frontend/src/hooks/useRiderActions.ts": "Provides a hook to update order status and refresh related queries after updates.",
  "frontend/src/index.css": "Defines global Tailwind styles, color themes, animations, and print styling for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/auth/LoginPage.tsx": "Renders the login page UI and triggers Internet Identity login with loading and error states.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "React page for creating a user profile, allowing entry of name and selection of role before saving via backend actor.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs success or failure.",
  "frontend/src/utils/adminKpis.ts": "Provides helper functions to filter orders by date/status, compute active riders, and calculate daily/monthly earnings.",
  "frontend/src/utils/deepLinks.ts": "Generates WhatsApp and Google Maps URLs, builds predefined messages, and offers clipboard copy utilities.",
  "frontend/src/utils/fileToBytes.ts": "Converts files to byte arrays, creates image URLs from bytes, and revokes generated object URLs.",
  "frontend/src/utils/reporting.ts": "Computes report metrics for orders over different periods and exports them as a CSV file.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's PWA vision, architectural guidelines, admin panel requirements, known issues, and existing feature records for the delivery app."
}