{
  "backend/main.mo": "Defines the main actor with order, rider, user profile, and access-control data models plus storage mixins and maps used for managing delivery operations.",
  "backend/migration.mo": "Provides a migration module that converts old order and user data structures into an expanded new format with additional fields and updated statuses.",
  "feature_evidence.json": "Lists feature evidence mapping feature IDs to related files, components, tests, and confidence levels for implemented functionality.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their roles in routing, hooks, components, and UI behavior.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode values, and applying base styles to elements and body.",
  "frontend/index.html": "HTML entry point setting metadata, manifest, icons, and loading the main React application.",
  "frontend/public/manifest.json": "PWA manifest configuring app name, theme colors, start behavior, and icons for installable usage.",
  "frontend/public/sw.js": "Service worker implementing install, fetch caching, and cache cleanup for offline support.",
  "frontend/src/App.tsx": "Main React app configuring routing, authentication redirects, service worker registration, and role-based navigation across customer, rider, and admin areas.",
  "frontend/src/areas/admin/AdminShell.tsx": "Main admin layout that handles auth state, logout, and tab-based navigation between admin pages.",
  "frontend/src/areas/admin/auth/AdminLoginPage.tsx": "Login form for admin users with client-side validation and local session handling.",
  "frontend/src/areas/admin/auth/useAdminAuth.ts": "Custom hook providing simple localStorage-based admin authentication with 24-hour session persistence.",
  "frontend/src/areas/admin/pages/AdminCreateOrderPage.tsx": "Form for admins to create new delivery orders with validation and mutation to backend.",
  "frontend/src/areas/admin/pages/AdminDashboardPage.tsx": "Dashboard showing order, rider, and earnings KPIs computed from fetched data.",
  "frontend/src/areas/admin/pages/AdminOrderDetailPage.tsx": "Order detail view enabling rider assignment, status updates, and viewing parcel/proof photos.",
  "frontend/src/areas/admin/pages/AdminOrdersPage.tsx": "Lists admin orders with filtering, loading states, and navigation to create or view order details.",
  "frontend/src/areas/admin/pages/AdminReportsPage.tsx": "Generates period-based order reports with CSV export and print support, displaying order metrics.",
  "frontend/src/areas/admin/pages/AdminRidersPage.tsx": "Manages riders including adding, editing location, and deleting, with dialogs and form handling.",
  "frontend/src/areas/admin/pages/AdminSettingsPage.tsx": "Allows updating company settings, uploading a logo, and managing delivery rate entries.",
  "frontend/src/areas/customer/components/CustomerBottomNav.tsx": "Renders a bottom navigation bar for customers to switch between booking, orders, and profile tabs.",
  "frontend/src/areas/customer/CustomerShell.tsx": "Provides the main customer layout with tab-based navigation among booking, orders, and profile pages.",
  "frontend/src/areas/customer/pages/CustomerBookDeliveryPage.tsx": "Form for customers to create delivery orders with optional parcel photo upload and success confirmation.",
  "frontend/src/areas/customer/pages/CustomerOrderDetailPage.tsx": "Displays detailed info for a customer's order, including status, addresses, photos, and a back button. Converts photo bytes to preview URLs and renders UI cards.",
  "frontend/src/areas/customer/pages/CustomerOrdersPage.tsx": "Shows the customer's list of orders with status badges and lets the user open an order detail view. Handles loading, empty state, and order selection.",
  "frontend/src/areas/customer/pages/CustomerProfilePage.tsx": "Renders the customer's profile info, app install button, and logout action. Fetches user data and clears identity on logout.",
  "frontend/src/areas/rider/components/RiderBottomNav.tsx": "Bottom navigation component for riders with tabs for orders and profile. Highlights active tab and triggers tab changes.",
  "frontend/src/areas/rider/pages/RiderOrderDetailPage.tsx": "Shows detailed rider order info with pickup navigation, parcel/proof photos, and status update actions. Supports uploading proof photos and updating order status.",
  "frontend/src/areas/rider/pages/RiderOrdersPage.tsx": "Lists rider-assigned orders with status badges and lets riders open detailed views. Handles loading, empty state, and order selection.",
  "frontend/src/areas/rider/pages/RiderProfilePage.tsx": "Rider profile page showing user info, app install option, and logout. Clears user data and identity on sign-out.",
  "frontend/src/areas/rider/RiderShell.tsx": "Container that switches between rider orders and profile pages using a bottom navigation bar.",
  "frontend/src/components/actions/WhatsAppMessageDialog.tsx": "Displays a dialog showing a WhatsApp message with a button to copy it to the clipboard.",
  "frontend/src/components/actions/WhatsAppOrderAction.tsx": "Creates a WhatsApp message for an order, opens WhatsApp, and shows a fallback dialog to copy the message if needed.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied screen with options to go back or sign out, clearing user data and identity.",
  "frontend/src/components/layout/AppSurface.tsx": "Provides a full‑screen gradient container wrapper for app pages.",
  "frontend/src/components/photos/PhotoCapturePicker.tsx": "Allows users to capture a photo with the camera or upload one, using a camera hook and dialog UI.",
  "frontend/src/components/pwa/FloatingInstallFab.tsx": "Shows a floating button to trigger PWA installation when available.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Provides a full‑width button to install the PWA, showing loading state during installation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useAdminOrders.ts": "Provides queries and mutations for managing orders, including fetching, updating status, assigning riders, and creating admin orders.",
  "frontend/src/hooks/useAdminRiders.ts": "Provides queries and mutations for managing riders, including fetching, adding, updating location, and client‑side deletion.",
  "frontend/src/hooks/useAdminSettings.ts": "Manages admin settings and logo storage in localStorage, plus managing customizable rate entries.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile and admin status and offers a helper to clear cached user data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider wrapping Dfinity AuthClient for loading, managing, and logging in with Internet Identity.",
  "frontend/src/hooks/useOrders.ts": "Defines React Query hooks to create orders and fetch user or single order data via an actor.",
  "frontend/src/hooks/usePhotoUploads.ts": "Offers mutations to upload parcel and proof photos and invalidates relevant order queries.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Handles Android PWA install prompt events and exposes install button state and actions.",
  "frontend/src/hooks/useRiderActions.ts": "Provides a mutation for riders to update order status and refreshes related queries.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, animations, gradients, and print rules.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen that triggers Internet Identity login and displays authentication state or errors.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "Profile setup form allowing users to submit name and role to create their profile.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker at /sw.js on page load if supported.",
  "frontend/src/utils/adminKpis.ts": "Utility functions computing order stats, active riders, and earnings for admin dashboards.",
  "frontend/src/utils/deepLinks.ts": "Generates WhatsApp and Google Maps URLs and provides a clipboard-copy helper.",
  "frontend/src/utils/fileToBytes.ts": "Provides helpers to convert files to byte arrays, generate image URLs from bytes, and revoke created object URLs.",
  "frontend/src/utils/reporting.ts": "Generates order-based report statistics for various time periods and exports them to CSV.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with sessionStorage persistence and hash support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, fonts, animations, and responsive container settings.",
  "project_state.json": "Describes the project’s PWA delivery app scope, architecture notes, known issues, and existing feature definitions."
}