{
  "backend/main.mo": "Defines delivery order types, user profiles, role-based authorization, and storage-backed order and photo management logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, theming, and base styling for light and dark modes.",
  "frontend/index.html": "Base HTML document setting metadata, app icons, manifest, and bootstrapping the React app.",
  "frontend/public/manifest.json": "PWA manifest configuring app name, icons, theme colors, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing basic caching for offline access and asset versioning.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, auth-based redirects, profile setup flow, and global providers.",
  "frontend/src/areas/admin/AdminShell.tsx": "Admin interface shell with dashboard and orders tabs wrapped in the AppSurface layout.",
  "frontend/src/areas/admin/pages/AdminDashboardPage.tsx": "Displays admin order statistics using fetched orders and shows counts by status in cards.",
  "frontend/src/areas/admin/pages/AdminOrderDetailPage.tsx": "Shows detailed admin view of an order, including addresses, photos, status, and rider assignment form.",
  "frontend/src/areas/admin/pages/AdminOrdersPage.tsx": "Lists all orders with filtering by status and supports navigating to a detailed order view.",
  "frontend/src/areas/customer/components/CustomerBottomNav.tsx": "Renders a bottom navigation bar allowing customers to switch between booking, orders, and profile tabs.",
  "frontend/src/areas/customer/CustomerShell.tsx": "Provides tab-based navigation for customer pages and renders the active section inside the app layout.",
  "frontend/src/areas/customer/pages/CustomerBookDeliveryPage.tsx": "Form for customers to create delivery orders with pickup/delivery details and optional parcel photo upload.",
  "frontend/src/areas/customer/pages/CustomerOrderDetailPage.tsx": "Displays a customer's order details including status, addresses, and photos, with a back button and WhatsApp action.",
  "frontend/src/areas/customer/pages/CustomerOrdersPage.tsx": "Displays the customer's orders list with loading/empty states and opens a detail page when an order is selected.",
  "frontend/src/areas/customer/pages/CustomerProfilePage.tsx": "Shows customer profile info, app install option, and logout action.",
  "frontend/src/areas/rider/components/RiderBottomNav.tsx": "Renders a bottom navigation bar for riders to switch between orders and profile tabs.",
  "frontend/src/areas/rider/pages/RiderOrderDetailPage.tsx": "Displays detailed rider order info with status updates, navigation, and proof photo upload.",
  "frontend/src/areas/rider/pages/RiderOrdersPage.tsx": "Lists rider-assigned orders with loading/empty states and navigates to order details.",
  "frontend/src/areas/rider/pages/RiderProfilePage.tsx": "Shows rider profile details, install option, and logout functionality.",
  "frontend/src/areas/rider/RiderShell.tsx": "Provides the main rider UI shell with tab navigation between orders and profile pages.",
  "frontend/src/components/actions/WhatsAppOrderAction.tsx": "Provides a WhatsApp contact button with a fallback dialog and message copy option.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with options to go back or sign out.",
  "frontend/src/components/layout/AppSurface.tsx": "Wraps pages in a styled full-screen surface container.",
  "frontend/src/components/photos/PhotoCapturePicker.tsx": "UI component allowing users to take photos via camera or upload files, using a camera hook and dialog interface.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Button that triggers PWA installation using a custom install prompt hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminOrders.ts": "Hooks for admins to fetch orders, filter by status, and assign riders with query invalidation.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks to fetch the current user's profile, admin status, and clear all cached user data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identity on startup and exposing login/clear actions.",
  "frontend/src/hooks/useOrders.ts": "Hooks for creating orders, fetching the user's orders, and retrieving a specific order with cache updates.",
  "frontend/src/hooks/usePhotoUploads.ts": "Hooks to upload parcel and proof photos to the backend, invalidating related order queries.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Captures the browser's beforeinstallprompt event to manage PWA installation state and trigger installation.",
  "frontend/src/hooks/useRiderActions.ts": "Hook allowing riders to update order status and triggering query invalidation.",
  "frontend/src/index.css": "Tailwind setup defining custom color themes, gradients, and utility classes for styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen invoking Internet Identity authentication with styled UI and loading/error states.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "React page for creating a user profile with name and role selection, submitting to backend and handling loading and errors.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load and logs success or failure.",
  "frontend/src/utils/deepLinks.ts": "Utility functions to build WhatsApp and Google Maps URLs, generate WhatsApp messages, and copy text to clipboard.",
  "frontend/src/utils/fileToBytes.ts": "Converts files to byte arrays, creates image URLs from bytes, and revokes created URLs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing them in sessionStorage, persisting parameters, and cleaning them from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app goals, architecture, required images, and implemented features with versions."
}