{
  "kind": "build_request",
  "title": "Match the app UI design to the reference website look-and-feel",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Update the app’s visual design (colors, typography, spacing, surfaces, shadows, and overall layout) to closely match the look-and-feel of the reference website at https://bikaner-express-delivery-08l.caffeine.xyz, using the uploaded screenshots as additional visual guidance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "https://bikaner-express-delivery-08l.caffeine.xyz \nYe jo website hai usi prakar app ka design nahi ban sakta kya"
        ]
      },
      "acceptanceCriteria": [
        "The app’s overall styling (background treatment, card style, typography scale, and button styles) is noticeably aligned with the reference website’s aesthetic, rather than the current default look.",
        "The changes apply consistently across Customer, Rider, and Admin areas (including login/setup screens), without breaking existing flows.",
        "No user-facing copy is changed away from English as part of this styling update (keep all visible UI text in English)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Refine the mobile UI patterns to match the reference design, including: bottom navigation appearance (height, icon/label sizing, selected/unselected states), page padding around content vs. fixed nav, and empty-state presentation for lists (e.g., orders list empty state card).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Ye jo website hai usi prakar app ka design nahi ban sakta kya"
        ]
      },
      "acceptanceCriteria": [
        "Customer and Rider bottom navigation bars visually match the intended reference styling (surface color, border/shadow, spacing, and active-state emphasis).",
        "List empty states (e.g., “No orders yet” card) use a cohesive card style consistent with the updated theme (proper elevation, padding, and readable contrast).",
        "Content is not obscured by fixed bottom navigation; safe padding remains correct on common Android viewport sizes."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Implement the design updates primarily via shared theme tokens and reusable styling (Tailwind config/theme variables and shared layout wrappers), avoiding page-by-page one-off styling where possible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "https://bikaner-express-delivery-08l.caffeine.xyz"
        ]
      },
      "acceptanceCriteria": [
        "Core visual updates are centralized (e.g., via CSS variables/Tailwind theme and shared layout components) so that Customer/Rider/Admin pages inherit the new look consistently.",
        "No edits are made to any frontend immutable paths listed in SYSTEM_CONTEXT (compose existing UI components instead of modifying them)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under the frontend immutablePaths listed in SYSTEM_CONTEXT (compose them instead).",
    "Keep backend behavior and data models unchanged; this request is design/UI only.",
    "Keep all user-facing UI text in English."
  ],
  "nonGoals": [
    "Implementing new delivery features, new admin capabilities, or changing existing business logic.",
    "Fixing ICP domain/canister resolution issues (e.g., \"Canister ID Not Resolved\"); this request is only about UI design matching.",
    "Adding third-party UI frameworks beyond the existing stack."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}