{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "UI theming and mobile layout alignment to reference website",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Refresh global visual styling (color system, typography, spacing, surfaces, shadows, and layout) to align with the reference website across Customer, Rider, and Admin flows without changing user-facing English copy.",
      "acceptanceCriteria": [
        "The app’s overall styling (background treatment, card style, typography scale, and button styles) is noticeably aligned with the reference website’s aesthetic, rather than the current default look.",
        "The changes apply consistently across Customer, Rider, and Admin areas (including login/setup screens), without breaking existing flows.",
        "No user-facing copy is changed away from English as part of this styling update (keep all visible UI text in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global CSS variables and base styles to match the reference look: background/surface treatments, elevation/shadow tokens, radius, border contrast, and consistent typography defaults; introduce shared CSS vars for mobile safe-area and bottom-nav height used across shells."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Centralize the refreshed design tokens in Tailwind theme extensions (colors mapped to CSS vars, refined shadows, border radii, and spacing/typography scale adjustments) so pages inherit the updated look consistently."
        },
        {
          "path": "frontend/src/components/layout/AppSurface.tsx",
          "operation": "modify",
          "description": "Adjust the root surface wrapper to use the updated background/surface styling (e.g., new theme tokens and safe-area padding), ensuring consistent page framing across Customer/Rider/Admin without per-page one-offs."
        },
        {
          "path": "frontend/src/components/layout/PageContainer.tsx",
          "operation": "create",
          "description": "Create a shared layout wrapper that standardizes page max-width, horizontal padding, top spacing, and section spacing to match the reference layout; use it across Customer/Rider/Admin pages to avoid one-off styling."
        },
        {
          "path": "frontend/src/pages/auth/LoginPage.tsx",
          "operation": "modify",
          "description": "Align the public login screen composition (card surface, header typography scale, spacing, and button styling) to the updated theme tokens while keeping all visible copy in English; keep existing generated icon usage intact."
        },
        {
          "path": "frontend/src/pages/auth/ProfileSetupPage.tsx",
          "operation": "modify",
          "description": "Align the profile setup screen surfaces and selection rows (radio options) with the updated theme (cards, borders, hover/active states, typography, spacing), keeping all copy in English."
        },
        {
          "path": "frontend/src/areas/admin/auth/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Align the admin login screen to the new theme (card elevation, inputs, button styling, spacing, and icon surface) and keep all visible copy in English."
        },
        {
          "path": "frontend/src/areas/admin/AdminShell.tsx",
          "operation": "modify",
          "description": "Update admin shell spacing and surfaces to match the new layout (header spacing, tabs surface/active styling via shared tokens/wrappers), ensuring consistent look with customer/rider areas without changing behavior."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Align the access denied screen card and button styles to the updated theme tokens (surface, shadows, border, typography) while keeping all copy in English."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Refine mobile UI patterns to match the reference design: bottom navigation appearance/states, content padding vs fixed nav, and cohesive empty-state cards for lists.",
      "acceptanceCriteria": [
        "Customer and Rider bottom navigation bars visually match the intended reference styling (surface color, border/shadow, spacing, and active-state emphasis).",
        "List empty states (e.g., “No orders yet” card) use a cohesive card style consistent with the updated theme (proper elevation, padding, and readable contrast).",
        "Content is not obscured by fixed bottom navigation; safe padding remains correct on common Android viewport sizes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/MobileBottomNav.tsx",
          "operation": "create",
          "description": "Create a shared mobile bottom navigation wrapper (surface, border/shadow, height, safe-area inset handling, icon/label sizing, active indicator styling) that Customer and Rider bottom navs compose. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/areas/customer/components/CustomerBottomNav.tsx",
          "operation": "modify",
          "description": "Refactor to compose the new shared MobileBottomNav for consistent height, padding, and active/unactive states aligned with the reference design. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/areas/rider/components/RiderBottomNav.tsx",
          "operation": "modify",
          "description": "Refactor to compose the new shared MobileBottomNav for consistent height, padding, and active/unactive states aligned with the reference design. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/patterns/EmptyStateCard.tsx",
          "operation": "create",
          "description": "Create a reusable empty-state card pattern (icon, title, description, consistent padding/elevation/contrast) that matches the updated theme and reference style. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/areas/customer/pages/CustomerOrdersPage.tsx",
          "operation": "modify",
          "description": "Update list empty/loading states to use the shared EmptyStateCard and adjust page padding to ensure content is not obscured by the fixed bottom navigation; maintain English copy."
        },
        {
          "path": "frontend/src/areas/rider/pages/RiderOrdersPage.tsx",
          "operation": "modify",
          "description": "Update list empty/loading states to use the shared EmptyStateCard and adjust page padding to ensure content is not obscured by the fixed bottom navigation; maintain English copy."
        },
        {
          "path": "frontend/src/areas/customer/CustomerShell.tsx",
          "operation": "modify",
          "description": "Normalize mobile safe padding and content inset relative to the fixed bottom nav by using shared layout vars/wrappers (remove ad-hoc padding where possible) so content stays visible on common Android viewport sizes."
        },
        {
          "path": "frontend/src/areas/rider/RiderShell.tsx",
          "operation": "modify",
          "description": "Normalize mobile safe padding and content inset relative to the fixed bottom nav by using shared layout vars/wrappers (remove ad-hoc padding where possible) so content stays visible on common Android viewport sizes."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Centralize design updates using shared theme tokens and reusable layout/styling patterns (Tailwind theme + shared wrappers), minimizing page-by-page one-off styling and avoiding changes to immutable frontend paths.",
      "acceptanceCriteria": [
        "Core visual updates are centralized (e.g., via CSS variables/Tailwind theme and shared layout components) so that Customer/Rider/Admin pages inherit the new look consistently.",
        "No edits are made to any frontend immutable paths listed in SYSTEM_CONTEXT (compose existing UI components instead of modifying them)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Consolidate the new design system into CSS variables and a small set of global utility classes (surface/elevation helpers, background treatment, bottom-nav safe-area vars) to minimize per-page styling."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Ensure Tailwind theme mappings rely on centralized CSS variables/tokens (colors/radii/shadows/typography) so updates propagate across Customer/Rider/Admin areas."
        },
        {
          "path": "frontend/src/components/layout/PageContainer.tsx",
          "operation": "modify",
          "description": "Ensure the shared PageContainer supports the majority of page spacing/layout needs (max-width, padding, section spacing) to reduce page-specific layout classes; keep it composable so immutable paths are not edited."
        },
        {
          "path": "frontend/src/components/layout/MobileBottomNav.tsx",
          "operation": "modify",
          "description": "Ensure MobileBottomNav encapsulates bottom-nav sizing/states and safe-area handling so CustomerBottomNav and RiderBottomNav stay minimal and consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/patterns/EmptyStateCard.tsx",
          "operation": "modify",
          "description": "Ensure EmptyStateCard supports common list empty-state needs (icon/title/description and optional actions) so order list pages don’t need one-off empty-state styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/areas/customer/pages/CustomerOrdersPage.tsx",
          "operation": "modify",
          "description": "Replace remaining one-off empty/loading card styling with shared patterns (PageContainer + EmptyStateCard) to demonstrate centralized styling adoption without changing business logic or English copy."
        },
        {
          "path": "frontend/src/areas/rider/pages/RiderOrdersPage.tsx",
          "operation": "modify",
          "description": "Replace remaining one-off empty/loading card styling with shared patterns (PageContainer + EmptyStateCard) to demonstrate centralized styling adoption without changing business logic or English copy."
        },
        {
          "path": "frontend/src/areas/admin/AdminShell.tsx",
          "operation": "modify",
          "description": "Adopt shared layout wrappers (PageContainer) and tokenized styles for admin header/tabs spacing so admin pages inherit the new look without broad per-page edits."
        }
      ]
    }
  ]
}